package gym.backend.consts.Email.RetrieveOrdersByEmail;

public class RetrieveOrdersValueConst {
    public static final String RETRIEVE_ORDER_INTRO_TEXT = "Желаем да ви информираме за текущите статуси на всички поръчки, свързани с вашия имейл адрес. Благодарим ви за вашето търпение и за доверието, което ни оказвате като наш клиент. Ето обновленията за всяка от тези поръчки:";
    public static final String RETRIEVE_ORDER_DISCLAIMER_ONE_TEXT = "Ако случайно не сте направили подобна заявка или имате въпроси относно статуса на вашите поръчки, моля, не се колебайте да се свържете с нас за повече информация. Нашите представители са на разположение, за да ви помогнат и да ви предоставят необходимата помощ.";
    public static final String RETRIEVE_ORDER_DISCLAIMER_TWO_TEXT = "Отбележете, че за нас е от основно значение данните на нашите клиенти да бъдат пазени с внимание и съобразно със законовите изисквания за защита на личните данни.";

}
