package gym.backend.consts.Email.Order;

public class EmailTemplateValues {
    public static final String PENDING_IMAGE_URL = "https://i.imgur.com/1ULULLx.png";
    public static final String PENDING_INTRO_TEXT = "Благодарим ви, че избрахте нашата платформа. Вашата поръчка предстои да се обработи от наш служител.";
    public static final String PENDING_DISCLAIMER_ONE_TEXT = "Наш служител ще се свърже с вас скоро, за да потвърди поръчката и да ви предостави допълнителна информация, ако е необходимо.";
    public static final String PENDING_DISCLAIMER_TWO_TEXT = "Благодарим ви за доверието и избора на нашата компания. Ако имате някакви въпроси, не се колебайте да се свържете с нас.";


    public static final String DELIVERY_IMAGE_URL = "https://i.imgur.com/FQMg50a.png";
    public static final String DELIVERY_INTRO_TEXT = "Искаме да ви уведомим, че вашата поръчка е вече предадена на куриерската фирма и е на път към вас. Очаквайте доставка в близките дни.";
    public static final String DELIVERY_DISCLAIMER_ONE_TEXT = "Независимо от старанията ни да осигурим бърза и безпроблемна доставка, възможни са ситуации на забавяне поради външни обстоятелства, които са извън нашия контрол. Ако доставката се забави, моля, свържете се с нас, за да ви предоставим актуална информация и да помогнем с решаването на проблема.";
    public static final String DELIVERY_DISCLAIMER_TWO_TEXT = "Също така, въпреки че внимателно опаковаме нашите продукти за да се предпазят по време на транспорт, инциденти като повреди по време на доставка може да се случат. Моля, проверете вашата пратка веднага след получаването и ако забележите каквито и да е повреди, свържете се с нас в най-кратък срок, за да можем да предприемем подходящи мерки.";

    public static final String COMPLETED_IMAGE_URL = "https://i.imgur.com/IQrk42O.png";
    public static final String COMPLETED_INTRO_TEXT = "Искаме да ви уведомим, че вашата пратка е била приета успешно и благодарим ви за вашата поръчка! С удоволствие бихме ви приветствали отново в нашия магазин и се надяваме, че ще намерите нови продукти и услуги, които да отговарят на вашите нужди.";
    public static final String COMPLETED_DISCLAIMER_ONE_TEXT = "Ние сме посветени на постоянното подобряване на нашите услуги и продукти, за да ви осигурим най-доброто пазарно изживяване. Затова всякаква обратна връзка от ваша страна е от съществено значение за нас. Независимо дали става дума за положителни впечатления или негативни такива, вашето мнение е ценно за нас.";
    public static final String COMPLETED_DISCLAIMER_TWO_TEXT = "Моля, не се колебайте да ни споделите вашите впечатления и мнения. Вашата обратна връзка ни помага да продължаваме да се развиваме и да предоставяме по-добри услуги за нашите клиенти.";

    public static final String CANCELED_IMAGE_URL = "https://i.imgur.com/0xet5aM.png";
    public static final String CANCELED_INTRO_TEXT = "Съжаляваме да ви уведомим, че вашата поръчка беше отказана и няма да бъде доставена. Ако не сте сигурни за причината за това отказване или имате някакви въпроси относно вашата поръчка, моля, не се колебайте да се свържете с нас.";
    public static final String CANCELED_DISCLAIMER_ONE_TEXT = "Ние сме тук, за да ви помогнем и да ви предоставим необходимата информация относно отказа на вашата поръчка. Моля, свържете се с нас чрез електронна поща или телефон, и ние ще направим всичко възможно, за да ви предоставим ясност и да ви помогнем с всякакви въпроси или проблеми, които имате.";
    public static final String CANCELED_DISCLAIMER_TWO_TEXT = "Благодарим ви за вашето разбиране и сътрудничество.";

    public static final String RETURNED_IMAGE_URL = "https://i.imgur.com/KyTSJxN.png";
    public static final String RETURNED_INTRO_TEXT = "Искаме да ви уведомим, че процесът за връщане на продуктите вече е задействан. След като получим върнатите от вас продукти, ще започнем процеса на обработка на вашето искане за възстановяване на средства.";
    public static final String RETURNED_DISCLAIMER_ONE_TEXT = "Моля, имайте предвид, че времето за обработка на възстановяването на плащането може да отнеме от 7 до 14 работни дни. Този период е необходим поради банковата обработка и вътрешните процедури за връщане на средства.";
    public static final String RETURNED_DISCLAIMER_TWO_TEXT = "Благодарим ви за вашето търпение и за разбирането ви по време на този процес. Ако имате някакви въпроси или нуждаете от допълнителна информация, моля, не се колебайте да се свържете с нас. Нашите колеги са на разположение, за да ви помогнат.";

    public static final String APPROVED_IMAGE_URL = "https://i.imgur.com/KJnLhAC.png";
    public static final String APPROVED_INTRO_TEXT = "Благодарим ви, че избрахте нашата платформа за вашата поръчка. Искаме да ви уведомим, че поръчката ви е подготвена за изпращане. Тя ще бъде натоварена и изпратена към зададения от вас адрес в най-кратък срок.";
    public static final String APPROVED_DISCLAIMER_ONE_TEXT = "Информираме ви, че доставката обикновено отнема между 3 и 5 работни дни. Въпреки стремежа ни да осигурим най-бързата възможна доставка, времето за доставка може да варира в зависимост от текущото натоварване на нашия магазин.";
    public static final String APPROVED_DISCLAIMER_TWO_TEXT = "Ако имате някакви притеснения или въпроси относно вашата поръчка или доставката й, моля, не се колебайте да се свържете с нас по време на работните ни часове. Екипът ни ще бъде на разположение, за да ви помогне и да отговори на всички ваши нужди.";

    public static final String SPEEDY_TRACKING_NUMBER_TABLE = "<td width=\"100%\" style=\"padding: 10px; word-break: break-word; border-top: 0px solid #ff2828; border-right: 0px solid #ff2828; border-bottom: 0px solid #ff2828; border-left: 0px solid #ff2828;\"><strong><span style=\"color: #00ff93;\">Проследи в Speedy:</span> speedyTrackingNumberValue</strong></td>";

}
